import logging
import os
import re
from enum import Enum

from dotenv import load_dotenv

load_dotenv()

logger = logging.getLogger(__name__)

TOKEN = os.getenv("TOKEN")
if not TOKEN:
    raise Exception("TOKEN not found")

MONGO_URI = os.getenv("MONGO_URI")
if not MONGO_URI:
    MONGO_URI = "mongodb://localhost:27017"
    logger.warning("MONGO_URI not found, using default value")
MONGO_DB_NAME = os.getenv("MONGO_DB_NAME", "TimohaBotKutuz")

ENVIRONMENT = os.getenv("ENVIRONMENT")
if not ENVIRONMENT:
    raise Exception("ENVIRONMENT not set")

IS_PRODUCTION = ENVIRONMENT.lower() == "production"
GUILD_ID = 1465391913229222103 if IS_PRODUCTION else 1460315965639229615

RANK_ROLES = {
    "Рядовой": 1465597566899982488,
    "Ефрейтор": 1465597565889282169,
    "Младший сержант": 1465597558712828027,
    "Сержант": 1465597557383368778,
    "Старший сержант": 1465597556598767780,
    "Старшина": 1465597555244142644,
    "Прапорщик": 1465597554275254273,
    "Старший прапорщик": 1465597552849060034,
    "Младший лейтенант": 1465597551821459598,
    "Лейтенант": 1465597550727004222,
    "Старший лейтенант": 1465597549313392856,
    "Капитан": 1465597548164022395,
    "Майор": 1465597547190943878,
    "Подполковник": 1465597545857290389,
    "Полковник": 1465597544464777364,
    "Генерал-майор": 1465597543428653140,
    "Генерал-лейтенант": 1465597542422020149,
    "Генерал-полковник": 1465597541369516152,
    "Генерал армии": 1465597540270346331,
}
if not IS_PRODUCTION:
    RANK_ROLES["Рядовой"] = 1460318445538246706
    RANK_ROLES["Младший сержант"] = 1460318656947818642
    RANK_ROLES["Старший сержант"] = 1460318688434721043

RANKS_SHORT = [
    "Р-й",
    "Еф-р",
    "Мл. С-т",
    "С-т",
    "Ст. С-т",
    "С-на",
    "Пр-к",
    "Ст. Пр-к",
    "Мл. Л-т",
    "Л-т",
    "Ст. Л-т",
    "К-н",
    "М-р",
    "П/п-к",
    "П-к",
    "Ген.-м",
    "Ген.-л",
    "Ген.-п",
    "Ген. а.",
]

RANK_EMOJIS = [
    "<:ryadovoy:1465597566899982488>",  # Рядовой
    "<:efreytor:1465597565889282169>",  # Ефрейтор
    "<:ml_serzhant:1465597558712828027>",  # Младший сержант
    "<:serzhant:1465597557383368778>",  # Сержант
    "<:st_serzhant:1465597556598767780>",  # Старший сержант
    "<:starshina:1465597555244142644>",  # Старшина
    "<:praporshchik:1465597554275254273>",  # Прапорщик
    "<:st_praporshchik:1465597552849060034>",  # Старший прапорщик
    "<:ml_leytenant:1465597551821459598>",  # Младший лейтенант
    "<:leytenant:1465597550727004222>",  # Лейтенант
    "<:st_leytenant:1465597549313392856>",  # Старший лейтенант
    "<:kapitan:1465597548164022395>",  # Капитан
    "<:mayor:1465597547190943878>",  # Майор
    "<:podpolkovnik:1465597545857290389>",  # Подполковник
    "<:polkovnik:1465597544464777364>",  # Полковник
    "<:generalmayor:1465597543428653140>",  # Генерал-майор
    "<:generalleytenant:1465597542422020149>",  # Генерал-лейтенант
    "<:generalpolkovnik:1465597541369516152>",  # Генерал-полковник
    "<:general_armii:1465597540270346331>",  # Генерал армии
]

RANKS = list(RANK_ROLES.keys())
AVAILABLE_FOR_REINSTATEMENT = RANKS[4:12]  # "Старший сержант" -> "Капитан"

CHANNELS = (
    {
        "audit": 1473300239535308841,
        "reinstatement": 1465597803668701235,
        "role_getting": 1465597814854783141,
        "blacklist": 1473300219809759327,
        "storage_requests": 1473300282200031367,
        "storage_audit": 1473300298029338877,
        "dismissal": 1246119825487564981,
        "static_log": 1473300472944394271,
        "timeoff": 1473397735263568069,
    }
    if IS_PRODUCTION
    else {
        "audit": 1460316387216986378,
        "reinstatement": 1460316020068581597,
        "role_getting": 1460316054101168366,
        "blacklist": 1460316417827278902,
        "storage_requests": 1460316441634017456,
        "storage_audit": 1460316457291354112,
        "dismissal": 1460316577449906196,
        "static_log": 1460316549331288342,
        "timeoff": 1460316491340841179,
    }
)

SUPPLY_ITEMS = {
    "Оружие": [
        "АК-74М",
        "Кольт М16",
        "Кольт 416 Канада",
        "ФН СКАР-Т",
        "Штейр АУГ-А3",
        "Таурус Бешеный бык",
        "Таурус Бешеный бык МК2",
        "CAP M249",
        "Обрез",
        "Тип 97",
        "Сайга-12К",
    ],
    "Броня": ["Средний бронежилет", "Тяжелый бронежилет"],
    "Медикаменты": [
        "Комплект мед. помощи",
        "Армейская аптечка",
        "Обезболивающее",
        "Дефибриллятор",
    ],
    "Прочее": ["Бодикамеры", "Патроны", "Материалы", "Прочее"],
}

SUPPLY_LIMITS = {
    "Оружие": 3,  # Лимит на категорию Оружие (суммарно)
    "Материалы": 2000,  # Материалы
    "Броня": 20,  # Бронежилеты
    "Медикаменты": 50,  # Общий лимит на медикаменты
    "Армейская аптечка": 25,  # Конкретный предмет
    "Обезболивающее": 15,  # Конкретный предмет
    "Дефибриллятор": 15,  # Конкретный предмет
}

BLACKLIST_MENTIONS = (1465597452223512649, 1465597454421459156, 1465597460876497039)
SUPPLIES_AUDIT_MENTIONS = (1465597452223512649, 1465597454421459156)
#                   Гражданин
EXCLUDED_ROLES = (1465597576299675916, 1465597577952235673)

if IS_PRODUCTION:

    class RoleId(Enum):
        REINFORCEMENT = 1318305723637301268
        ATTESTATION = 1246115278992048262
        CONTRACT = 1246115199124111544
        MILITARY = 1246114676136218714  # Военнослужащий ВС РФ
        MILITARY_ACADEMY = 1246114673460252692  # Военная академия
        SUPPLY_ACCESS = 1246115197781934161  # Доступ к поставке
        GOV_EMPLOYEE = 1251432181381861477  # Гос. сотрудник
        GENERAL_HQ = 1411507570195173447  # Генеральный штаб
        BRIGADE_HQ = 1246113826953367714  # Штаб бригады
        UNIT_COMMANDER = 1246113827972583474  # Командир подразделения
        UNIT_DEPUTY_COMMANDER = 1246113944524034070  # Зам. командира подразделения

else:

    class RoleId(Enum):
        REINFORCEMENT = 1465597518682263552
        CONTRACT = 1473292614315806780
        MILITARY = 1462831391438934128  # Военнослужащий ВС РФ
        MILITARY_ACADEMY = 1465597494229729463  # Военная академия
        SUPPLY_ACCESS = 1473295577419874489  # Доступ к поставке
        GOV_EMPLOYEE = 1465597537229475902  # Гос. сотрудник
        GENERAL_HQ = 1465597466639601857  # Генеральный штаб
        BRIGADE_HQ = 1465597475652898816  # Штаб бригады
        UNIT_COMMANDER = 1473295785658548378  # Командир подразделения
        UNIT_DEPUTY_COMMANDER = 1473295785658548378  # Зам. командира подразделения


PENALTY_THRESHOLD = 5
#                1 предупреждение     2 предупреждения     1 выговор
PENALTY_ROLES = (1465597569026621576, 1465597570167476254, 1465597572612751453)
INVESTIGATION_ROLE = 1465597520783740950  # Ведется расследование


class RankIndex:
    """Индексы званий для проверок прав доступа"""

    PRIVATE = 0  # Рядовой
    CORPORAL = 1  # Ефрейтор
    JUNIOR_SERGEANT = 2  # Младший сержант
    SERGEANT = 3  # Сержант
    SENIOR_SERGEANT = 4  # Старший сержант
    SERGEANT_MAJOR = 5  # Старшина
    WARRANT_OFFICER = 6  # Прапорщик
    SENIOR_WARRANT = 7  # Старший прапорщик
    JUNIOR_LIEUTENANT = 8  # Младший лейтенант
    LIEUTENANT = 9  # Лейтенант
    SENIOR_LIEUTENANT = 10  # Старший лейтенант
    CAPTAIN = 11  # Капитан
    MAJOR = 12  # Майор
    LIEUTENANT_COLONEL = 13  # Подполковник
    COLONEL = 14  # Полковник
    MAJOR_GENERAL = 15  # Генерал-майор
    LIEUTENANT_GENERAL = 16  # Генерал-лейтенант
    COLONEL_GENERAL = 17  # Генерал-полковник
    ARMY_GENERAL = 18  # Генерал армии


SUPPLY_INFO_LINK = "https://discord.com/channels/1465391913229222103/1473300032190021825/1475823536458174506"

CAPTAIN_RANK_INDEX = RankIndex.CAPTAIN
nickname_regex = re.compile("^([А-яЁё][а-яё]+) ([А-яЁё][а-яё]+)$")
