reinstatement_title = "# Восстановление во фракцию"
reinstatement_submission = (
    "### Подача заявления\n"
    "Чтобы восстановиться во фракцию воспользуйтесь кнопкой снизу."
)
reinstatement_requirements = """### Требования к заявлению
1. Восстановление доступно со звания Старший Сержант.
2. Восстановление невозможно, если имя или фамилия были изменены.
3. Причиной увольнения должно быть собственное желание или перевод."""
reinstatement_system = """### Система восстановления
- Звание определяется по результатам переаттестации.
- Итоговый ранг не может быть выше указанного в военном билете.
- Максимальное звание для восстановления Младший лейтенант."""

role_title = "# Подача заявления на роль"
role_submission = (
    "### Подача заявления\nЧтобы подать заявление на роль воспользуйтесь кнопкой снизу."
)
role_requirements = """### Информация
1. Убедитесь в достоверности введённых данных.
2. Заявления рассматриваются в течение 24 часов.
"""

supply_audit_title = "# Аудит выдачи снаряжения"
supply_audit_description = (
    "### Аудит выдачи снаряжения\n"
    "Вы можете отправить в аудит запись о чистке, выдаче склада."
)

timeoff_title = "# Подача заявления на отгул"
timeoff_submission = "### Подача заявления\nЧтобы подать заявление на отгул воспользуйтесь кнопкой снизу."
timeoff_description = """### Информация
1. Заявления доступны со звания Старший сержант.
2. Заявления можно подать только на сегодняшний день.
3. Разрешено брать отгул только один раз в день."""